/* includes- возвращает true, если в строке есть искомая подстрока
    startsWith- возвращает true, если строка начинается с искомой подстроки
    endsWith- возвращает true, если строка заканчивается искомой подстрокой
    repeat- повторяет строку нужное количество раз
    replace- заменяет искомую подстроку на новую
    slice- возвращает часть строки
    split- разбивает строку на массив подстрок
    substr- возвращает часть строки
    substring- возвращает часть строки
    toLowerCase- приводит строку к нижнему регистру
    toUpperCase- приводит строку к верхнему регистру
    trim- удаляет пробелы в начале и в конце строки
    charAt- возвращает символ по индексу
    charCodeAt- возвращает код символа по индексу
    concat- объединяет строки
    indexOf- возвращает индекс первого вхождения искомой подстроки
    lastIndexOf- возвращает индекс последнего вхождения искомой подстроки
    localeCompare- сравнивает строки в зависимости от языка
    match- возвращает массив совпадений с искомой подстрокой
    search- возвращает индекс первого совпадения с искомой подстрокой
    toString- приводит объект к строке
    valueOf- возвращает примитивное значение объекта
 */
